DROP TABLE IF EXISTS students;
DROP TABLE IF EXISTS teachers;
DROP TABLE IF EXISTS genders;
DROP TABLE IF EXISTS grades;
DROP TABLE IF EXISTS groups;
DROP TABLE IF EXISTS subjects;
DROP TABLE IF EXISTS classes;
DROP TABLE IF EXISTS lessons;
DROP table if exists students_subjects;
DROP TABLE IF EXISTS teachers_subjects;
DROP TABLE IF EXISTS groups_subjects;


CREATE TABLE students (
	student_id INTEGER PRIMARY KEY,
	first_name VARCHAR(30) NOT NULL,
	last_name VARCHAR(30) NOT NULL,
	email VARCHAR(30) NOT NULL,
	phone VARCHAR(30) NOT NULL,
	gender_id INTEGER,
	created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
	CONSTRAINT genders_FK FOREIGN KEY (gender_id) REFERENCES genders(gender_id) ON DELETE SET NULL ON UPDATE CASCADE
);

CREATE TABLE genders (
  gender_id INTEGER PRIMARY KEY,
  name VARCHAR(30),
  created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

CREATE TABLE teachers (
  teacher_id INTEGER PRIMARY KEY,
  first_name VARCHAR(50) NOT NULL,
  last_name VARCHAR(50) NOT NULL,
  email VARCHAR(40) NOT NULL UNIQUE,
  phone VARCHAR(30) NOT NULL UNIQUE,
  gender_id INTEGER,
  lesson_id INTEGER,
  created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
  CONSTRAINT genders_FK FOREIGN KEY (gender_id) REFERENCES genders(gender_id) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT lesson_FK FOREIGN KEY (lesson_id) REFERENCES lessons(lesson_id) ON DELETE SET NULL ON UPDATE CASCADE
);

CREATE TABLE subjects (
  subject_id INTEGER PRIMARY KEY,
  name VARCHAR(80),
  created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

-- REAL GRADES
CREATE TABLE grades (
  id INTEGER PRIMARY KEY,
  value INTEGER,
  created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
  student_id INTEGER,
  teacher_id INTEGER,
  subject_id INTEGER,
  CONSTRAINT students_FK FOREIGN KEY (student_id) REFERENCES students(student_id) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT teachers_FK FOREIGN KEY (teacher_id) REFERENCES teachers(teacher_id) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT subjects_FK FOREIGN KEY (subject_id) REFERENCES subjects(subject_id) ON DELETE SET NULL ON UPDATE CASCADE
);

CREATE TABLE teachers_subjects(
  id INTEGER PRIMARY KEY,
  teacher_id INTEGER,
  subject_id INTEGER,
  CONSTRAINT teachers_FK FOREIGN KEY (teacher_id) REFERENCES teachers(teacher_id) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT subjects_FK FOREIGN KEY (subject_id) REFERENCES subjects(subject_id) ON DELETE SET NULL ON UPDATE CASCADE
);

CREATE TABLE groups (
  group_id INTEGER PRIMARY KEY,
  name VARCHAR(80),
  student_id INTEGER,
  lesson_id INTEGER,
  created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
  CONSTRAINT students_FK FOREIGN KEY (student_id) REFERENCES students(student_id) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT lesson_FK FOREIGN KEY (lesson_id) REFERENCES lessons(lesson_id) ON DELETE SET NULL ON UPDATE CASCADE
);

CREATE TABLE groups_subjects (
  id INTEGER PRIMARY KEY,
  group_id INTEGER,
  subject_id INTEGER,
  CONSTRAINT groups_FK FOREIGN KEY (group_id) REFERENCES groups(group_id) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT subjects_FK FOREIGN KEY (subject_id) REFERENCES subjects(subject_id) ON DELETE SET NULL ON UPDATE CASCADE
);

CREATE TABLE lessons (
  lesson_id INTEGER PRIMARY KEY,
  teacher_id INTEGER,
  started_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

-- -- -- -- -- -- -- -- -- -- -- -- --
-- ПОЛ (МУЖЧИНА/ЖЕНЩИНА)
INSERT INTO genders (name) VALUES("male"), ("female");

-- ГРУППЫ
INSERT INTO groups (name) VALUES("І-12"), ("ІМз-01с"), ("ІК.мз-11с");

-- ПРЕДМЕТЫ
INSERT INTO subjects (name) VALUES
   ("Технічна термодинаміка"),
   ("Основи охорони праці та БЖД"),
   ("Нормативно-правове забезпечення"),
   ("ДЗВ загальної підготовки"),
   ("Деталі машин");

-- УЧИТЕЛЯ
INSERT INTO teachers (first_name, last_name, email, phone, gender_id) VALUES
  ("Андрій", "Євдокимов","a.yevdokymov@biem.sumdu.edu.ua","+38 (0542) 33-30-98", 1),
  ("Ольга","Лукаш","o.lukash@biem.sumdu.edu.ua","+38 (0542) 33-22-24", 2),
  ("Ірина","Дегтярьова","i.dehtyarova@biem.sumdu.edu.ua","+38 (0542) 33-22-23", 2);

-- СТУДЕНТЫ
 INSERT INTO students (first_name, last_name, email, phone, gender_id) VALUES
   ("Карина", "Ведмидера", "k.vedmedera@gmail.com", "+38066-345-12-23", 2),
   ("Валентина", "Немеш", "v.nemesh@gmail.com", "+38050-864-21-32", 2),
   ("Анна", "Науменко", "a.naumenko@gmail.com", "+38067-484-13-21", 2),
   ("Софія", "Малус", "s.malus@gmail.com", "+38097-344-50-56", 2),
   ("Альона", "Павленко", "a.pavlenko@gmail.com", "+38050-112-32-18", 2),
   ("Владіслав", "Харченко", "v.harchenko@gmail.com", "+38050-211-22-81", 1),
   ("Іван", "Воробйов", "i.vorobiyoff@gmail.com", "+38050-121-45-71", 1),
   ("Катерина", "Шамкало", "k.shamkalo@gmail.com", "+38066-331-67-99", 2),
   ("Віталій", "Козловський", "v.kozlovsky@gmail.com", "+38066-456-54-66", 1),
   ("Юлія", "Розгон", "j.rozgon@gmail.com", "+38066-555-66-12", 2),
   ("Тетяна", "Головач", "t.golovach@gmail.com", "+38050-551-16-21", 2),
   ("Артем", "Мірошниченко", "a.miroshnichenko@gmail.com", "+38066-888-56-87", 1),
   ("Євгенія", "Бондаренко", "e.bondarenko@gmail.com", "+38050-155-62-78", 2),
   ("Анастасія", "Тутук", "a.tutuk@gmail.com", "+38066-900-08-35", 2),
   ("Іван", "Челноков", "i.chelnokov@gmail.com", "+38068-454-77-34", 1),
   ("Маргарита", "Голубнича", "m.golubcha@gmail.com", "+38050-090-80-53", 2),
   ("Григорій", "Пивоваров", "g.pivovaroff@gmail.com", "+38066-441-67-54", 1),
   ("Андрій", "Носенко", "a.nosenko@gmail.com", "+38066-232-11-04", 1),
   ("Катерина", "Логвиненко", "k.logvinenko@gmail.com", "+38050-231-67-99", 2),
   ("Владислава", "Матьякубова", "v.matijakubova@gmail.com", "+38050-132-33-99", 2),
   ("Яна", "Євдокімова", "j.evdokimova@gmail.com", "+38067-144-33-99", 2),
   ("Максим", "Дудко", "m.dudko@gmail.com", "+38050-777-11-04", 1),
   ("Артур", "Гуденко", "a.gudenko@gmail.com", "+38067-666-22-04", 1),
   ("Владислав", "Колос", "v.kolos@gmail.com", "+38067-555-22-04", 1),
   ("Богдан", "Ващенко", "b.vaschenko@gmail.com", "+38068-444-22-04", 1),
   ("Руслан", "Вербицький", "r.verbitsky@gmail.com", "+38067-333-22-04", 1),
   ("Ілля", "Дейнека", "i.deyneka@gmail.com", "+38067-222-22-04", 1),
   ("Артем", "Юрченко", "a.yurchenko@gmail.com", "+38067-111-22-04", 1),
   ("Вікторія", "Сокура", "v.sokura@gmail.com", "+38055-114-33-99", 2),
   ("Владислав", "Трофименко", "v.trofimenko@gmail.com", "+38066-341-22-04", 1);

-- ОЦЕНКИ, КОТОРЫЕ ПОСТАВИЛ УЧИТЕЛЬ СТУДЕНТУ ЗА ОПРЕДЕЛЕННЫЙ ПРЕДМЕТ
  INSERT INTO grades (student_id, teacher_id, subject_id, value) VALUES
(1, 2, 1, 3), (1, 1, 2, 5), (1, 1, 4, 5), (1, 2, 2, 5), (1, 1, 2, 3), (1, 2, 4, 4),
(1, 1, 2, 4), (1, 1, 5, 1), (1, 3, 4, 2), (1, 3, 5, 3), (1, 1, 3, 2), (1, 3, 2, 4),
(1, 1, 4, 2), (1, 2, 2, 4), (1, 2, 4, 5), (1, 3, 2, 3), (1, 3, 4, 3), (1, 1, 2, 4),
(1, 1, 4, 2), (1, 2, 3, 2), (2, 1, 2, 3), (2, 2, 1, 5), (2, 2, 4, 1), (2, 3, 3, 2),
(2, 1, 1, 5), (2, 3, 1, 4), (2, 2, 5, 2), (2, 1, 4, 5), (2, 1, 2, 3), (2, 3, 4, 1),
(2, 2, 4, 5), (2, 1, 3, 3), (2, 2, 4, 3), (2, 3, 1, 1), (2, 3, 3, 3), (2, 2, 5, 1),
(2, 1, 5, 4), (2, 1, 3, 2), (2, 2, 5, 5), (2, 3, 1, 1), (3, 2, 3, 3), (3, 3, 5, 5),
(3, 2, 5, 4), (3, 3, 3, 4), (3, 3, 3, 1), (3, 2, 5, 5), (3, 3, 2, 1), (3, 3, 1, 1),
(3, 1, 2, 5), (3, 3, 5, 5), (3, 3, 3, 2), (3, 1, 2, 1), (3, 1, 4, 1), (3, 1, 1, 4),
(3, 2, 3, 1), (3, 2, 3, 2), (3, 3, 1, 3), (3, 2, 2, 3), (3, 3, 5, 3), (3, 3, 1, 3),
(4, 3, 4, 2), (4, 2, 5, 4), (4, 3, 4, 4), (4, 2, 1, 3), (4, 3, 3, 1), (4, 1, 5, 3),
(4, 2, 1, 5), (4, 2, 5, 2), (4, 1, 3, 2), (4, 2, 4, 5), (4, 1, 4, 1), (4, 1, 1, 5),
(4, 2, 3, 2), (4, 1, 5, 3), (4, 1, 1, 4), (4, 3, 4, 3), (4, 2, 1, 2), (4, 1, 4, 2),
(4, 2, 3, 4), (4, 3, 3, 3), (5, 2, 4, 1), (5, 2, 3, 2), (5, 1, 4, 5), (5, 3, 1, 5),
(5, 2, 5, 4), (5, 1, 2, 2), (5, 2, 5, 2), (5, 1, 2, 2), (5, 2, 3, 1), (5, 2, 2, 3),
(5, 3, 5, 3), (5, 2, 3, 5), (5, 3, 1, 1), (5, 2, 3, 3), (5, 1, 1, 4), (5, 1, 1, 2),
(5, 1, 2, 3), (5, 1, 5, 1), (5, 1, 5, 5), (5, 2, 4, 2), (6, 1, 1, 2), (6, 2, 4, 5),
(6, 2, 4, 1), (6, 1, 3, 5), (6, 3, 4, 1), (6, 3, 1, 4), (6, 1, 4, 5), (6, 1, 4, 1),
(6, 1, 1, 3), (6, 2, 5, 5), (6, 2, 4, 5), (6, 1, 2, 5), (6, 1, 5, 5), (6, 3, 1, 4),
(6, 1, 1, 3), (6, 3, 2, 4), (6, 3, 2, 1), (6, 1, 5, 1), (6, 3, 5, 5), (6, 1, 1, 1),
(7, 3, 4, 1), (7, 3, 1, 3), (7, 3, 4, 1), (7, 3, 3, 1), (7, 2, 2, 2), (7, 2, 4, 4),
(7, 2, 5, 3), (7, 1, 1, 2), (7, 3, 4, 2), (7, 1, 4, 3), (7, 3, 3, 1), (7, 2, 2, 1),
(7, 3, 1, 5), (7, 2, 1, 5), (7, 2, 5, 1), (7, 2, 2, 3), (7, 3, 4, 3), (7, 2, 3, 1),
(7, 1, 1, 3), (7, 2, 2, 3), (8, 3, 4, 5), (8, 1, 5, 1), (8, 2, 3, 3), (8, 1, 4, 3),
(8, 3, 2, 5), (8, 2, 4, 5), (8, 2, 2, 4), (8, 2, 4, 4), (8, 2, 5, 3), (8, 2, 4, 5),
(8, 2, 5, 3), (8, 1, 5, 1), (8, 1, 3, 3), (8, 2, 2, 5), (8, 2, 2, 1), (8, 3, 1, 3),
(8, 3, 1, 5), (8, 2, 3, 2), (8, 2, 1, 3), (8, 2, 4, 3), (9, 3, 4, 3), (9, 1, 1, 3),
(9, 3, 2, 1), (9, 2, 3, 2), (9, 1, 1, 2), (9, 3, 4, 4), (9, 2, 3, 5), (9, 2, 4, 5),
(9, 3, 1, 4), (9, 1, 1, 2), (9, 2, 4, 2), (9, 3, 5, 2), (9, 2, 3, 4), (9, 3, 2, 1),
(9, 1, 3, 3), (9, 1, 1, 1), (9, 1, 3, 5), (9, 3, 2, 3), (9, 2, 5, 2), (9, 3, 5, 1),
(10, 2, 4, 3), (10, 3, 2, 3), (10, 3, 5, 1), (10, 3, 1, 2), (10, 2, 1, 3), (10, 2, 4, 2),
(10, 2, 3, 3), (10, 3, 1, 2), (10, 1, 4, 3), (10, 3, 2, 1), (10, 2, 4, 4), (10, 2, 4, 1),
(10, 1, 4, 2), (10, 3, 3, 2), (10, 3, 5, 1), (10, 2, 1, 2), (10, 2, 4, 4), (10, 1, 1, 4),
(10, 1, 5, 1), (10, 2, 1, 2), (11, 1, 4, 4), (11, 2, 1, 3), (11, 3, 1, 2), (11, 3, 2, 2),
(11, 2, 3, 3), (11, 1, 1, 2), (11, 1, 2, 2), (11, 2, 2, 1), (11, 1, 2, 4), (11, 1, 5, 4),
(11, 2, 5, 4), (11, 3, 3, 4), (11, 3, 1, 1), (11, 2, 2, 4), (11, 2, 2, 4), (11, 2, 3, 5),
(11, 1, 1, 4), (11, 2, 3, 4), (11, 3, 3, 2), (11, 1, 1, 1), (12, 2, 1, 4), (12, 1, 1, 5),
(12, 3, 1, 4), (12, 2, 2, 1), (12, 2, 3, 3), (12, 3, 3, 3), (12, 1, 4, 2), (12, 3, 2, 5),
(12, 1, 5, 4), (12, 2, 2, 5), (12, 1, 4, 4), (12, 2, 2, 5), (12, 2, 2, 1), (12, 3, 5, 3),
(12, 2, 3, 3), (12, 1, 2, 3), (12, 3, 1, 2), (12, 2, 3, 4), (12, 2, 3, 4), (12, 3, 3, 3),
(13, 2, 3, 4), (13, 1, 5, 2), (13, 1, 2, 1), (13, 3, 5, 1), (13, 3, 3, 5), (13, 3, 1, 1),
(13, 3, 3, 3), (13, 3, 5, 2), (13, 2, 3, 1), (13, 3, 5, 4), (13, 3, 4, 4), (13, 3, 1, 1),
(13, 3, 1, 2), (13, 1, 2, 4), (13, 3, 5, 3), (13, 1, 5, 3), (13, 2, 3, 4), (13, 2, 4, 4),
(13, 1, 1, 1), (13, 3, 5, 5), (14, 1, 3, 1), (14, 2, 5, 4), (14, 2, 2, 4), (14, 3, 1, 2),
(14, 2, 1, 1), (14, 2, 1, 4), (14, 3, 1, 4), (14, 2, 1, 4), (14, 2, 2, 2), (14, 2, 4, 4),
(14, 3, 3, 3), (14, 3, 2, 4), (14, 1, 5, 3), (14, 3, 1, 5), (14, 3, 3, 1), (14, 2, 3, 4),
(14, 3, 2, 3), (14, 1, 4, 2), (14, 1, 4, 3), (14, 2, 1, 5), (15, 3, 5, 3), (15, 2, 5, 1),
(15, 2, 4, 1), (15, 2, 4, 3), (15, 1, 1, 3), (15, 2, 4, 1), (15, 3, 3, 5), (15, 2, 4, 4),
(15, 3, 2, 1), (15, 3, 5, 2), (15, 2, 4, 1), (15, 3, 1, 4), (15, 3, 3, 5), (15, 3, 4, 4),
(15, 2, 2, 3), (15, 1, 4, 1), (15, 2, 5, 3), (15, 3, 5, 3), (15, 3, 5, 1), (15, 1, 2, 3),
(16, 3, 3, 4), (16, 2, 3, 5), (16, 1, 4, 5), (16, 3, 5, 1), (16, 2, 5, 4), (16, 2, 5, 4),
(16, 3, 2, 3), (16, 2, 5, 3), (16, 1, 3, 4), (16, 3, 1, 2), (16, 1, 3, 4), (16, 2, 1, 3),
(16, 1, 4, 5), (16, 1, 5, 1), (16, 1, 2, 1), (16, 1, 4, 1), (16, 3, 2, 1), (16, 1, 3, 1),
(16, 3, 2, 2), (16, 2, 4, 3), (17, 1, 5, 4), (17, 3, 1, 4), (17, 3, 1, 2), (17, 3, 3, 4),
(17, 2, 5, 5), (17, 2, 3, 1), (17, 3, 4, 2), (17, 3, 4, 5), (17, 1, 3, 4), (17, 1, 4, 4),
(17, 3, 5, 5), (17, 2, 1, 5), (17, 1, 2, 3), (17, 3, 1, 4), (17, 1, 3, 2), (17, 2, 3, 3),
(17, 3, 3, 1), (17, 2, 3, 3), (17, 2, 3, 2), (17, 1, 5, 5), (18, 3, 4, 2), (18, 2, 1, 5),
(18, 2, 2, 3), (18, 3, 4, 3), (18, 3, 1, 4), (18, 2, 2, 5), (18, 3, 1, 5), (18, 1, 4, 2),
(18, 2, 2, 4), (18, 3, 2, 1), (18, 2, 2, 2), (18, 1, 2, 2), (18, 3, 4, 3), (18, 2, 2, 5),
(18, 1, 4, 5), (18, 2, 1, 1), (18, 1, 4, 2), (18, 2, 2, 5), (18, 3, 5, 1), (18, 3, 3, 3),
(19, 3, 1, 5), (19, 2, 3, 2), (19, 1, 2, 4), (19, 2, 5, 4), (19, 1, 3, 5), (19, 1, 3, 2),
(19, 2, 5, 3), (19, 3, 1, 1), (19, 2, 3, 1), (19, 3, 5, 1), (19, 2, 1, 4), (19, 2, 1, 5),
(19, 2, 2, 2), (19, 1, 1, 2), (19, 1, 5, 5), (19, 3, 5, 5), (19, 3, 4, 2), (19, 2, 3, 4),
(19, 2, 5, 4), (19, 2, 3, 3), (20, 1, 4, 5), (20, 3, 2, 1), (20, 1, 2, 5), (20, 3, 3, 3),
(20, 3, 3, 2), (20, 3, 3, 1), (20, 3, 3, 1), (20, 2, 4, 5), (20, 1, 5, 4), (20, 2, 5, 2),
(20, 1, 2, 3), (20, 3, 1, 2), (20, 1, 2, 2), (20, 1, 5, 2), (20, 3, 1, 3), (20, 1, 2, 4),
(20, 1, 5, 4), (20, 2, 1, 3), (20, 2, 4, 4), (20, 2, 2, 2), (21, 1, 3, 1), (21, 2, 2, 1),
(21, 2, 3, 1), (21, 3, 5, 1), (21, 2, 1, 1), (21, 2, 1, 3), (21, 1, 3, 5), (21, 2, 2, 1),
(21, 3, 4, 1), (21, 1, 1, 1), (21, 3, 4, 2), (21, 3, 2, 2), (21, 2, 1, 4), (21, 3, 5, 2),
(21, 2, 2, 5), (21, 2, 1, 5), (21, 1, 3, 1), (21, 1, 5, 2), (21, 3, 2, 4), (21, 3, 3, 2),
(22, 3, 2, 2), (22, 3, 4, 4), (22, 1, 3, 4), (22, 1, 1, 1), (22, 1, 3, 2), (22, 2, 1, 5),
(22, 2, 5, 3), (22, 1, 3, 4), (22, 1, 4, 1), (22, 3, 4, 3), (22, 1, 2, 5), (22, 2, 1, 3),
(22, 1, 3, 3), (22, 1, 2, 4), (22, 2, 4, 5), (22, 2, 5, 2), (22, 2, 2, 4), (22, 3, 3, 3),
(22, 1, 3, 3), (22, 1, 3, 3), (23, 2, 2, 4), (23, 1, 5, 1), (23, 2, 5, 2), (23, 3, 1, 5),
(23, 3, 5, 3), (23, 3, 1, 2), (23, 2, 1, 4), (23, 1, 3, 1), (23, 2, 2, 1), (23, 3, 1, 5),
(23, 2, 3, 5), (23, 1, 3, 4), (23, 2, 5, 1), (23, 3, 1, 3), (23, 2, 2, 5), (23, 2, 3, 4),
(23, 1, 5, 3), (23, 3, 2, 3), (23, 1, 3, 4), (23, 3, 2, 2), (24, 2, 4, 1), (24, 1, 5, 3),
(24, 1, 3, 3), (24, 1, 5, 3), (24, 3, 1, 5), (24, 2, 3, 1), (24, 1, 1, 2), (24, 2, 3, 2),
(24, 3, 1, 2), (24, 1, 4, 4), (24, 2, 4, 1), (24, 3, 2, 3), (24, 1, 5, 2), (24, 1, 2, 2),
(24, 1, 3, 2), (24, 3, 1, 5), (24, 3, 5, 2), (24, 3, 1, 3), (24, 2, 4, 4), (24, 1, 3, 4),
(25, 1, 3, 3), (25, 1, 3, 3), (25, 1, 3, 3), (25, 1, 4, 2), (25, 1, 5, 1), (25, 3, 3, 5),
(25, 1, 4, 2), (25, 3, 4, 3), (25, 3, 2, 2), (25, 2, 3, 4), (25, 2, 1, 2), (25, 2, 1, 2),
(25, 2, 4, 5), (25, 1, 2, 5), (25, 1, 1, 5), (25, 2, 1, 4), (25, 2, 2, 5), (25, 3, 1, 2),
(25, 3, 5, 3), (25, 3, 1, 2), (26, 1, 2, 4), (26, 3, 4, 1), (26, 2, 1, 4), (26, 2, 4, 3),
(26, 3, 2, 5), (26, 3, 5, 3), (26, 3, 5, 2), (26, 3, 3, 4), (26, 2, 2, 2), (26, 1, 3, 1),
(26, 3, 4, 3), (26, 2, 1, 1), (26, 1, 1, 1), (26, 3, 1, 1), (26, 3, 1, 5), (26, 1, 2, 3),
(26, 1, 2, 3), (26, 3, 4, 1), (26, 3, 2, 1), (26, 3, 5, 4), (27, 2, 2, 5), (27, 1, 5, 1),
(27, 3, 4, 4), (27, 1, 5, 2), (27, 1, 5, 4), (27, 1, 4, 1), (27, 3, 2, 2), (27, 1, 2, 2),
(27, 1, 1, 1), (27, 3, 1, 4), (27, 1, 3, 3), (27, 3, 5, 2), (27, 3, 1, 5), (27, 1, 4, 1),
(27, 3, 3, 4), (27, 2, 1, 1), (27, 1, 5, 5), (27, 1, 2, 2), (27, 1, 5, 1), (27, 2, 1, 5),
(28, 2, 5, 2), (28, 3, 2, 5), (28, 2, 2, 3), (28, 3, 5, 2), (28, 1, 1, 2), (28, 3, 2, 2),
(28, 2, 3, 4), (28, 3, 4, 5), (28, 2, 4, 1), (28, 2, 1, 4), (28, 2, 5, 2), (28, 3, 4, 1),
(28, 3, 2, 5), (28, 1, 5, 1), (28, 3, 1, 2), (28, 2, 2, 3), (28, 1, 3, 2), (28, 2, 4, 1),
(28, 3, 5, 3), (28, 1, 3, 1), (29, 2, 2, 4), (29, 1, 1, 3), (29, 1, 3, 2), (29, 3, 5, 2),
(29, 2, 5, 2), (29, 1, 5, 3), (29, 3, 4, 3), (29, 3, 4, 2), (29, 3, 2, 1), (29, 3, 5, 1),
(29, 3, 5, 4), (29, 3, 4, 4), (29, 3, 4, 3), (29, 1, 1, 1), (29, 1, 3, 3), (29, 1, 3, 5),
(29, 2, 4, 1), (29, 2, 2, 5), (29, 2, 2, 2), (29, 2, 4, 5), (30, 3, 2, 3), (30, 2, 4, 1),
(30, 2, 4, 4), (30, 3, 4, 2), (30, 1, 4, 3), (30, 3, 1, 1), (30, 3, 5, 2), (30, 1, 3, 2),
(30, 1, 1, 5), (30, 2, 3, 2), (30, 1, 4, 5), (30, 1, 2, 5), (30, 2, 2, 2), (30, 3, 2, 4),
(30, 1, 2, 4), (30, 2, 1, 3), (30, 2, 1, 3), (30, 2, 4, 3), (30, 3, 1, 1), (30, 1, 4, 2)
