'''
функция для вывода списка коллег, которых надо поздравить с днём рождения на
текущей неделе.
У вас есть список словарей users, каждый словарь в нём обязательно имеет ключи
name и birthday. Такая структура представляет модель списка пользователей с их
именами и днями рождения. name -- это строка с именем пользователя,
а birthday -- это datetime объект в котором записан день рождения.
Ваша задача написать функцию congratulate, которая получает на вход список users
и выводит в консоль (при помощи print) список пользователей которых надо
поздравить по дням.
'''
#import collections
#Users = collections.namedtuple("User", ["name", "birthday"])

from datetime import date, timedelta


def next_week(idx=0):
    '''Get a list of the days of the next week.

    Key arguments:
    idx - Day of the week number.
    '''
    # dt - Current date.
    dt = date.today()
    days_ahead = idx - dt.weekday()
    if days_ahead <= 0:
        days_ahead += 7
    nx_wkday = dt + timedelta(days_ahead)
    # We get a list of dates from Mon to Sun.
    if idx < 6:
        return [nx_wkday.strftime("%d.%m.%Y")] + next_week(idx+1)
    else:
        return [nx_wkday.strftime("%d.%m.%Y")]


def congratulate(users):
    # выводим список именинников, которых надо поздравить
    # на этой неделе под дням
    print(birthday_boys)


users = [{"name": "Бобриєвич Микола Сергійович", "birthday": "01.03.1975"},
         {"name": "Бобров Віктор Олександрович", "birthday": "13.04.1965"},
         {"name": "Богданов Анатолій Іванович", "birthday": "23.05.1943"},
         {"name": "Богдановський Вольдемар Станіславович", "birthday": "11.01.1987"},
         {"name": "Васіле Боереску", "birthday": "21.04.1989"},
         {"name": "Божок Василь Миколайович", "birthday": "16.11.1990"},
         {"name": "Мехмет Боздаг", "birthday": "05.08.1980"},
         {"name": "Шатьєндранат Бозе", "birthday": "10.02.1991"},
         {"name": "Волтер Бойд", "birthday": "14.01.1965"},
         {"name": "Бойко Сергій Юлійович", "birthday": "06.06.1966"},
         {"name": "Бойцов Василь Васильович", "birthday": "07.07.1997"},
         {"name": "Большаков Леоні", "birthday": "19.08.1995"},
         {"name": "Календюк Іван Хрисанфович", "birthday": "15.04.1976"},
         {"name": "Калиниченко Ігор Олександрович", "birthday": "12.06.1976"},
         {"name": "Калитовський Ієронім Павлович", "birthday": "19.10.1994"},
         {"name": "Калуга Василь Іванович", "birthday": "18.10.1996"},
         {"name": "Кальченко Катерина Олексіївна", "birthday": "20.10.1997"},
         {"name": "Іштван Камараш", "birthday": "21.10.1998"},
         {"name": "Камболов Руслан Олександрович", "birthday": "22.10.1999"},
         {"name": "Франсіско Камера", "birthday": "23.10.2000"},
         {"name": "Фернандо Кампос", "birthday": "24.10.2001"},
         {"name": "Камшилов Олег Анатолійович", "birthday": "25.10.2002"},
         {"name": "Вільгельм Канаріс", "birthday": "26.10.2003"},
         {"name": "Мілена Канонеро", "birthday": "27.10.2004"},
         {"name": "Каплієнко Ніна Германівна", "birthday": "27.10.2004"},
         {"name": "Мохаммед Карам", "birthday": "28.10.2004"},
         {"name": "Елпіда Караманді", "birthday": "29.10.2004"},
         {"name": "Корчинський Василь Леонтійович", "birthday": "30.10.2005"},
         {"name": "Косач Петро Антонович", "birthday": "31.10.1997"},
         {"name": "Котлярський Борис Моїсейович", "birthday": "01.11.2001"},
         {"name": "Френк Коулман", "birthday": "02.11.2003"},
         {"name": "Юрген Кох", "birthday": "03.11.2004"},
         {"name": "Кочерга Володимир Семенович", "birthday": "04.11.2005"},
         {"name": "Кошовий Олег Костянтинович", "birthday": "05.11.2006"}]
